EDT/УТ/src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <attributes>
    <name>МодельОборудования</name>
    <type>
      <types>CatalogRef.МоделиОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/СвязанноеОборудование/СвязанноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанноеОборудование</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусМонтирования</name>
    <type>
      <types>EnumRef.СтатусыМонтированияОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОборудованиеВладелец</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеПодчиненное</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЕдиницыОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеПовреждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СостоянияЕдиницыОборудования/СостоянияЕдиницыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЕдиницыОборудования</name>
  <enumValues>
    <name>Выдано</name>
  </enumValues>
  <enumValues>
    <name>Сдано</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыОборудования/ТипыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОборудования</name>
  <enumValues>
    <name>ПринтерЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>Смартфон</name>
  </enumValues>
  <enumValues>
    <name>Планшет</name>
  </enumValues>
  <enumValues>
    <name>ТерминалПриемаОплатыПоКарте</name>
  </enumValues>
  <enumValues>
    <name>SIMКарта</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СтатусыМонтированияОборудования/СтатусыМонтированияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМонтированияОборудования</name>
  <enumValues>
    <name>Смонтировано</name>
  </enumValues>
  <enumValues>
    <name>Демонтировано</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СтатусыЕдиницыОборудования/СтатусыЕдиницыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЕдиницыОборудования</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВышлоИзСтроя</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
  <enumValues>
    <name>ЗакрепленоЗаСотрудником</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УстановкаСтатусаОборудования/УстановкаСтатусаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаОборудования</name>
  <registerRecords>AccumulationRegister.УчетОстатковОборудования</registerRecords>
  <registerRecords>InformationRegister.СтатусыОборудования</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОборудования</name>
    <type>
      <types>EnumRef.СтатусыЕдиницыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/МоделиОборудования/МоделиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиОборудования</name>
  <predefined>
    <items>
      <name>SIMКарта</name>
      <description>SIMКарта</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/Оборудование/Forms/ВводНомераSIM/Module.bsl
&НаКлиенте
Функция ПроверитьСтрокуЦифр(СтрокаЦифр)
	
	ДлинаСтроки = СтрДлина(СтрокаЦифр);
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Если Не СтрНайти("1234567890", Сред(СтрокаЦифр, НомерСимвола, 1)) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьОборудованиеSIM()
	
	ОборудованиеSIM = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерSIM", "%" + НомерSIM + "%");
	
	Если СостояниеОборудования = Перечисления.СостоянияЕдиницыОборудования.Выдано Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Оборудование.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОборудованиеSIM
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МоделиОборудования КАК МоделиОборудования
		|		ПО (МоделиОборудования.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.SIMКарта))
		|			И Оборудование.МодельОборудования = МоделиОборудования.Ссылка
		|			И (Оборудование.ПараметрОборудования ПОДОБНО &НомерSIM)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОборудованиеSIM.Ссылка КАК ОборудованиеSIM,
		|	СвязанноеОборудованиеСрезПоследних.ОборудованиеВладелец КАК ОборудованиеВладелец,
		|	СвязанноеОборудованиеСрезПоследних.ОборудованиеВладелец.МодельОборудования.ТипОборудования КАК ТипОборудования,
		|	СвязанноеОборудованиеСрезПоследних.ОборудованиеВладелец.Наименование КАК Наименование,
		|	УчетОборудованияСрезПоследних.ФизЛицо.Наименование КАК ФизЛицоНаименование
		|ИЗ
		|	ВТ_ОборудованиеSIM КАК ВТ_ОборудованиеSIM
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанноеОборудование.СрезПоследних(
		|				,
		|				ОборудованиеПодчиненное В
		|					(ВЫБРАТЬ
		|						ВТ_ОборудованиеSIM.Ссылка КАК Ссылка
		|					ИЗ
		|						ВТ_ОборудованиеSIM КАК ВТ_ОборудованиеSIM)) КАК СвязанноеОборудованиеСрезПоследних
		|		ПО (СвязанноеОборудованиеСрезПоследних.СтатусМонтирования = ЗНАЧЕНИЕ(Перечисление.СтатусыМонтированияОборудования.Смонтировано))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОборудования.СрезПоследних(
		|				,
		|				Оборудование В
		|					(ВЫБРАТЬ
		|						ВТ_ОборудованиеSIM.Ссылка КАК Ссылка
		|					ИЗ
		|						ВТ_ОборудованиеSIM КАК ВТ_ОборудованиеSIM)) КАК УчетОборудованияСрезПоследних
		|		ПО (УчетОборудованияСрезПоследних.СостояниеЕдиницыОборудования = ЗНАЧЕНИЕ(Перечисление.СостоянияЕдиницыОборудования.Выдано))";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			НачатьТранзакцию();
			Попытка
				Спр = Справочники.Оборудование.СоздатьЭлемент();
				Спр.Наименование = "SIM карта";
				Спр.МодельОборудования = Справочники.МоделиОборудования.SIMКарта;
				Спр.ПараметрОборудования = НомерSIM;
				Спр.Записать();
				
				ОборудованиеSIM = Спр.Ссылка;
				
				Док = Документы.УстановкаСтатусаОборудования.СоздатьДокумент();
				Док.Регион = Регион;
				Док.СтатусОборудования = Перечисления.СтатусыЕдиницыОборудования.ВРаботе;
				Док.Пользователь = ПараметрыСеанса.ТекущийПользователь;
				Док.СписокОборудования.Добавить().Оборудование = ОборудованиеSIM;
				Док.Дата = ТекущаяДата();
				Док.Записать(РежимЗаписиДокумента.Проведение);
				ЗафиксироватьТранзакцию();
			Исключение
				ОборудованиеSIM = ОписаниеОшибки();
				ОтменитьТранзакцию();
			КонецПопытки;
			
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Если Выборка.ОборудованиеВладелец = Null Тогда
				Если Выборка.ФизЛицоНаименование = Null Тогда
					ОборудованиеSIM = Выборка.ОборудованиеSIM;
				Иначе
					ОборудованиеSIM = "Данная SIM карта уже выдана " + СокрП(Выборка.ФизЛицоНаименование) + "!";
				КонецЕсли;
			Иначе
				ОборудованиеSIM = "Данная SIM карта уже установлена в оборудование " + Выборка.ТипОборудования + """, наименование " + Выборка.Наименование + ". Сперва удалите SIM карту из указанного оборудования!";
			КонецЕсли;
		КонецЕсли;
		
	Иначе//Сдано
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Оборудование.Ссылка КАК ОборудованиеSIM
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МоделиОборудования КАК МоделиОборудования
		|		ПО (МоделиОборудования.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыОборудования.SIMКарта))
		|			И Оборудование.МодельОборудования = МоделиОборудования.Ссылка
		|			И (Оборудование.ПараметрОборудования ПОДОБНО &НомерSIM)";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ОборудованиеSIM = "SIM карта не найдена!";
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ОборудованиеSIM = Выборка.ОборудованиеSIM;
		КонецЕсли;
		
	КонецЕсли;
	Возврат ОборудованиеSIM;
	
КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)
	
	//СтрокаЦифр = "8(ххх)ххх-хх-хх";
	Если Не ПустаяСтрока(НомерSIM) И ПроверитьСтрокуЦифр(Сред(НомерSIM, 3, 3) + Сред(НомерSIM, 7, 3) + Сред(НомерSIM, 11, 2) + Прав(НомерSIM, 2)) Тогда
		ОборудованиеSIM = ПолучитьОборудованиеSIM();
		Если ТипЗнч(ОборудованиеSIM) = Тип("Строка") Тогда
			ПоказатьПредупреждение(, ОборудованиеSIM);
		ИначеЕсли ОборудованиеSIM <> Неопределено Тогда
			Закрыть(ОборудованиеSIM);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Введите номер в формате 8(999)999-99-99");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Асеев 06.06.2024 (Задача № 5259)>>>
	Если Не Параметры.Свойство("СостояниеОборудования", СостояниеОборудования) Тогда
		СостояниеОборудования = Перечисления.СостоянияЕдиницыОборудования.Выдано;
	КонецЕсли;
	//Асеев 06.06.2024 (Задача № 5259)<<<
	//Асеев 10.07.2024 (Задача № 5259)>>>
	Параметры.Свойство("Регион", Регион);
	//Асеев 10.07.2024 (Задача № 5259)<<<

КонецПроцедуры
